questions = [
    {
        "quest" : "Сколько планет в солнечной системе?",
        "answer" : ["5", "6", "8", "7"],
        "right": "8"
    },

    {
        "quest" : "Сколько раз дипсик может ошибиться в собственном коде",
        "answer" : ["1", "2", "7", "4"],
        "right": "7"
    },

    {
        "quest" : "Проходной бал на ОГЭ по инфе",
        "answer" : ["10", "12", "5", "7"],
        "right": "5"
    },

    {
        "quest" : "Сколько проходной балл на ОГЭ по физике",
        "answer" : ["12", "10", "15", "11"],
        "right": "10"
    },

    {
        "quest" : "Формула Архимедовой силы",
        "answer" : ["F=p*g*V", "V=p*h+F", "F=p*V", "p=v*h"],
        "right": "F=p*g*V"
    },

    {
        "quest" : "Кем был впервые ссформирован закон сохранения импульса",
        "answer" : ["Рене Декартом", "Исаак Ньютон", "Я", "не знаю"],
        "right": "Рене Декартом"
    }
]